package com.blueberry.star.data;

import com.blueberry.star.entity.Star;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by Administrator on 8/3/2017.
 */
public final class StarData {

    public static List<Star> stars = new ArrayList<Star>();
    static int generateId = 0;

    static {
        stars.add(createStart("刘亦菲", 0, "1987年8月25日",
                "https://gss0.bdstatic.com/94o3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike116%2C" +
                        "5%2C5%2C116%2C38/sign=62d1cff37b8b4710da22f59ea2a7a898/962bd40735fae6cda3f99" +
                        "cb306b30f2443a70f96.jpg", "刘亦菲，1987年8月25日出生于湖北省武汉市，华语影视女演员、流行乐歌手，毕业于北京电影学院2002级表演系本科班。\n" +
                        "2002年主演个人首部电视剧《金粉世家》，从而踏入演艺圈[1]  。2003年因主演武侠剧《天龙八部》崭露头角[2]  。2004年凭借仙侠剧《仙剑奇侠传》赵灵儿一角获得了高人气与关注度[3]  。2005年因在金庸剧《神雕侠侣》中饰演小龙女受到广泛关注[4-5]  。2006年发行首张国语专辑《刘亦菲》[6]  ；同年，被评选为第6届中国金鹰电视艺术节首位金鹰女神[7]  。2008年起转战影坛，并凭借动作片《功夫之王》在好莱坞IMDB电影新人排行榜中夺得全球人气指数第一名[8-9]  。2011年起，其主演的奇幻片《新倩女幽魂》、战争片《鸿门宴》等电影票房均破亿[10-12]  。\n" +
                        "2014年，凭借剧情片《铜雀台》中灵雎一角获得第5届澳门国际电影节最佳女主角[13]  。2015年主演都市爱情片《第三种爱情》，并凭该片获得第16届华语电影传媒大奖最受瞩目女演员[14]  。2016年，其出演的文艺片《夜孔雀》入围了第40届蒙特利尔国际电影节主竞赛单元[15]  。2017年，获得“GMIC互联网时代电影人物”奖[16]  ；8月3日，其主演的古装玄幻电影《三生三世十里桃花》上映[17-18]  。\n" +
                        "演艺事业外，刘亦菲热心慈善公益，被授予“中国儿童慈善奖”称号，担任中国少年儿童基金会形象大使等，两次被评选为“中国80后十大杰出代表人物”[19-20]  。"));
        stars.add(createStart("Angelababy ", 0, "1989年2月28日", "https://gss3.bdstatic.c" +
                        "om/-Po3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike116%2C5%2C5%2C116%2C38/sign=f7bfefce8" +
                        "a0a19d8df0e8c575293e9ee/cc11728b4710b912f3fc4081c9fdfc039245228b.jpg",
                "Angelababy（杨颖），1989年2月28日出生于上海市，华语影视女演员、时尚模特。\n" +
                        "2003年，Angelababy以模特身份出道，此后，她因担任时尚模特而在香港崭露头角。2007年，她开始将工作重心转向大银幕。2011年，她在爱情片《夏日乐悠悠》中首次担任女主角[1]  。2012年，凭借言情片《第一次》获得第13届华语电影传媒大奖最受瞩目女演员奖[2]  。2013年，Angelababy与其她三位女艺人被《南都娱乐周刊》选为新“四小花旦”；同年，她还完成了个人的荧屏处女作《大汉情缘之云中歌》[3]  。\n" +
                        "2014年，Angelababy开始凭借真人秀《奔跑吧兄弟》赢得广泛关注[4]  ；同年，她还因出演古装片《狄仁杰之神都龙王》获得第21届北京大学生电影节最受欢迎女演员奖[5]  。2015年，其主演的冒险片《鬼吹灯之寻龙诀》票房突破16亿人民币[6]  ，而她也凭借该片获得第33届大众电影百花奖最佳女配角奖[7]  。2017年，其主演的古装剧《孤芳不自赏》取得全国同时段电视剧收视冠军[8]  。"));
        stars.add(createStart("高圆圆", 0, "1979年10月5日",
                "https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike116%2C5%2C5%2C116%2C38/sign=045f823c1938534398c28f73f27adb1b/00e93901213fb80e4a9910873fd12f2eb9389411.jpg",
                "高圆圆出生于北京市丰台区云岗一个普通的知识分子家庭[14]  。1996年，还在上高中的她与同学到王府井买书，碰到一家广告公司的员工周康宇，其介绍高圆圆拍摄了一支冰激凌的广告，这是高圆圆的第一条广告。之后几年间，高圆圆拍摄了大量的商业广告，在广告圈中崭露头角，其中以2000年奥运会期间播出的清嘴含片广告中，清新甜美的邻家女孩而赢得了更高的询问度和人气，同时也让她得到了“清嘴女孩”的称号[1]  。\n" +
                        "高中毕业后，高圆圆并没有像其它大陆演员一样报考专业的艺术院校，而是就读于一所普通高校中国工运学院经济学系（现改名为中国劳动关系学院），在大学期间间断出演了一些电影与电视剧，以清丽单纯的邻家女孩形象而为人所知[1]  。"));
        stars.add(createStart("王祖贤", 0, "1967年1月31日",
                "https://gss1.bdstatic.com/-vo3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike92%2C5%2C5%2C92%2C30/sign=dc55bc78cc5c10383073c690d378f876/cc11728b4710b912fdf94a9cc9fdfc0392452293.jpg",
                "王祖贤（Joey Wong），1967年1月31日生于台湾省台北市，华语影视女演员、歌手。\n" +
                        "1984年，首次主演电影《今年的湖畔会很冷》，其后签约邵氏电影公司到香港发展。1987年，凭借电影《倩女幽魂》中聂小倩一角提名香港电影金像奖最佳女主角。1992年，凭借电影《倩女幽魂Ⅲ：道道道》获得第25届西班牙锡切斯奇幻电影节最佳女主角。\n" +
                        "1994年后，王祖贤逐渐淡出影视圈。1998年发行了个人国语专辑《与世隔绝》与日语专辑《Angelus》。2004年，王祖贤主演的电影《美丽上海》获得第24届中国电影金鸡奖最佳故事片奖[1]  ；同年，拍完电影《美丽上海》后宣布息影。"));
        stars.add(createStart("章子怡", 0, "1979年2月9日",
                "https://gss2.bdstatic.com/-fo3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike80%2C5%2C5%2C80%2C26/sign=e858d4f10d2442a7ba03f5f7b02ac62e/6159252dd42a28344292d87959b5c9ea15cebf88.jpg",
                "章子怡，1979年2月9日出生于北京，华语影视女演员，2000年毕业于中央戏剧学院。\n" +
                        "1998年被张艺谋发掘，凭主演的个人首部电影《我的父亲母亲》获得第50届柏林国际电影节银熊奖而一举成名。1999年主演的电影《卧虎藏龙》荣获第73届奥斯卡、第58届金球奖最佳外语片奖，因此跻身国际影坛[1]  。2005年主演斯皮尔伯格监制的电影《艺伎回忆录》，该片获得第78届奥斯卡三项大奖，章子怡成为主演电影两度获得奥斯卡奖的华人演员，并入围美国电影金球奖、英国电影学院奖、美国演员工会奖最佳女演员奖[2]  ；同年登上《Vanity Fair》封面、第四次登上《时代周刊》封面并上榜“影响世界的100人”，并入选“中国电影百年百位优秀演员”。[3-4]  2010年被亚洲电影博览会授予“21世纪前十年亚洲最杰出女演员”称号[5]  。\n" +
                        "2013年，凭借主演的电影《一代宗师》而获得金马奖、金像奖、百花奖、亚太电影节、亚洲电影大奖等超过12座奖项，[6]  并同时获得“大众电影百花奖、中国电影华表奖、中国电影金鸡奖、香港电影金像奖、台湾电影金马奖”最佳女主角奖[7]  ，并刷新了华语影坛凭借一部电影获的最佳女主角奖次数最多的记录。[8-9] \n" +
                        "演艺事业外，章子怡担任中国电影推广大使，在海外积极参与推广宣传华语电影。自2005年起章子怡担任奥斯卡终身评委，并连续担任第77和78届奥斯卡颁奖嘉宾。自2006年起三次担任戛纳国际电影节评委。"));
        stars.add(createStart("巩俐", 0, "1965年12月31日",
                "https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=a6dd52dd942f07085f052d06d11fdfa4/5fdf8db1cb1349542828a8f65c4e9258d1094a69.jpg",
                "巩俐（Gong Li），1965年12月31日出生于辽宁沈阳，新加坡籍华裔女演员，祖籍中国山东，毕业于中央戏剧学院，联合国促进和平艺术家，联合国全球环境保护大使。[1-4] \n" +
                        "1987年因主演抗战爱情片《红高粱》成名，该片获得柏林国际电影节金熊奖；1992年凭借农村题材电影《秋菊打官司》获得第49届威尼斯国际电影节最佳女演员奖，该片亦获得金狮奖；1993年主演的民国伦理电《霸王别姬》获得戛纳国际电影节金棕榈奖，因而巩俐成为世界影史第二位主演影片包揽欧洲三大国际电影节最高奖的演员[5-7]  ；同年获得柏林国际电影节金摄影机奖并上榜美国《人物》全球最美50人；1996年登上美国《时代周刊》封面并上榜全球十大人物；1997年担任戛纳国际电影节评委会成员。\n" +
                        "2000年担任柏林国际电影节评委会主席并获得蒙特利尔国际电影节最佳女演员奖及艺术成就大奖；2002年担任威尼斯国际电影节评委会主席；2003年担任东京国际电影节评委会主席；2004年获得戛纳国际电影节纪念大奖；同年上榜美国《首映》影史百大伟大表演；2005年入选中国电影百年50位有突出贡献艺术家；2006年上榜美国《时代周刊》60年亚洲英雄和美国《华盛顿邮报》全球年度5位伟大演员。[8-15] \n" +
                        "2010年法国文化部授予其“艺术与文学勋章”司令勋位；2014年担任上海国际电影节评委会主席；2015年入选联合国16位影响人类文化艺术家。[16-22]  2016年2月8日主演的古装神话电影《西游记之孙悟空三打白骨精》上映[23]  。"));
        stars.add(createStart("谢娜", 0, "1981年5月6日",
                "https://gss0.bdstatic.com/-4o3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=d1c53a22982397ddd6799f0261b9d58a/5bafa40f4bfbfbed1f9935ba71f0f736aec31f36.jpg",
                "谢娜，1981年5月6日出生于四川省德阳市中江县，毕业于四川师范大学电影电视学院（今四川电影电视学院），中国内地主持人、歌手、影视女演员。\n" +
                        "1996年，谢娜拍摄了个人第一部电影《青年刘伯承》。2002年，因主持湖南卫视嘉宾访谈游戏秀节目《快乐大本营》被观众熟知。2008年，参演古装武侠剧《射雕英雄传》[1]  。2013年，主演喜剧片《快乐大本营之快乐到家》[2]  ；同年，她还获得中国大学生电视节最受大学生喜爱的电视节目主持人奖[3]  。2015年，参加明星生活体验秀节目《偶像来了》[4]  ；同年，她还主持了两季伪音乐类纯网络综艺节目《偶滴歌神啊》[5-6]  。2016年，除了主持喜剧脱口秀节目《娜就这么说》和剧情式吐槽脱口秀《暴走法条君》[7-8]  ；谢娜还参与了明星女神生活体验真人秀《我们来了》[9]  。2017年，主持儿童智趣才艺脱口秀节目《神奇的孩子》[10]  ；随后，以补位歌手的身份加盟明星跨界音乐真人秀节目《跨界歌王第二季》并获得亚军[11-12]  。"));
        stars.add(createStart("关之琳", 0, "1962年9月24日",
                "https://gss2.bdstatic.com/9fo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=8318a4919122720e7bcee5fc43f06d7b/bba1cd11728b471033fdfc3fcacec3fdfd032376.jpg",
                "关之琳（Rosamund Kwan），1962年9月24日出生于香港，祖籍辽宁沈阳。满族正白旗瓜尔佳氏，中国香港女演员、歌手。[1] \n" +
                        "1981年，关之琳中学毕业后加入丽的电视成为艺员。1982年，关之琳参演她的首部电影《再见江湖》。20世纪90年代，关之琳与李连杰主演了《黄飞鸿》系列电影，饰演十三姨。1992年，关之琳与刘德华主演了电影《九二神雕侠侣之痴心情长剑》，并在影片中饰演了姑姑。1993年，关之琳与梁朝伟、梅艳芳主演了电影《新仙鹤神针》，饰演蓝小蝶。1998年，被美国杂志《PEOPLE》评选为“全球50位最美丽的名人”。2005年，主演了电影《做头》。2009年4月30日，关之琳宣布息影，之后便很少出现在荧幕上。\n" +
                        "2010年，关之琳在Lancome75周年法式卓越庆祝午宴“真我女性演绎大奖颁奖典礼”上，获得了完美女性奖。[2] "));
        stars.add(createStart("贾静雯", 0, "1974年10月7日",
                "https://gss3.bdstatic.com/-Po3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=2d47b617f7faaf5184e386b9b46ff3d3/86d6277f9e2f0708cb643431e324b899a901f29a.jpg",
                "贾静雯（Alyssa Chia），1974年10月7日出生于台湾省台北市，祖籍天津市，华语影视女演员、节目主持人。\n" +
                        "1990年，贾静雯因接拍爱之味妞妞甜八宝广告而出道演艺圈；同年，她还出演了个人的首部电视剧《佳家福》。1994年，贾静雯开始担任一系列儿童节目的主持人。1997年，她凭借家庭剧《四千金》获得台湾电视金钟奖最佳新人奖[1]  。2000年，贾静雯主演的古装剧《飞龙在天》获得了台湾电视剧年度收视冠军。\n" +
                        "2001年，贾静雯将工作重心转向内地，并主演了传奇剧《大汉天子》。2002年，她凭借武侠剧《倚天屠龙记》在内地赢得更高关注度[2]  。2003年，贾静雯获得FHM全球百大性感美女亚洲区冠军。2006年，他主演了现代剧《悲伤时唱首歌》。此后几年，贾静雯相继出演了传奇剧《太平公主秘史》、剧情片《不能说的夏天》等影视作品。"));
        stars.add(createStart("安以轩", 0, "1980年9月29日",
                "https://gss1.bdstatic.com/-vo3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike80%2C5%2C5%2C80%2C26/sign=7eec5f184836acaf4ded9eae1db0e675/0824ab18972bd40780f9cfdc78899e510fb309d0.jpg",
                "安以轩，1980年9月29日出生于台湾省台北市，毕业于台湾观光学院，中国台湾女演员、歌手。\n" +
                        "2000年，凭借偶像剧《麻辣鲜师》出道；2003年，主演了动作喜剧片《中国功夫少女组》；2004年，因主演偶像剧《斗鱼》而受到关注；2005年，主演了古装玄幻剧《仙剑奇侠传》，由此被内地观众熟识；2006年，主演了青春偶像剧《车神》；2007年，发行首张个人专辑《I'm天秤座》，由此获得了第八届音乐风云榜港台地区最佳新人奖和9+2音乐先锋榜2007最受欢迎女新人提名[1-2]  ；2008年，主演了民国情感剧《芸娘》；2009年，主演了青春偶像剧《下一站，幸福》，该剧连续19周获得台湾同时段收视冠军[3]  ；2010年，参演了爱情喜剧电影《非诚勿扰2》，并为电影演唱了主题曲《爱过》。\n" +
                        "2011年，主演了古装宫廷言情剧《后宫》；2012年，出演了都市爱情喜剧片《结婚狂想曲》；2014年，主演了爱情喜剧片《好命先生》；2015年，主演了年代侦探悬疑剧《昙花梦》。2016年，凭借浪漫爱情电影《我是处女座》获得了第8届澳门国际电影节最佳女主角提名[4]  。\n" +
                        "2017年3月15日，安以轩和陈荣炼在微博宣告婚讯。[5] "));

    }

    static Star createStart(String name, int gender, String dateOfBorth, String photo, String basicInfo) {
        Star star = new Star();
        star.setId(generateId++);
        star.setName(name);
        star.setDateOfBirth(dateOfBorth);
        star.setGender(gender);
        star.setPhoto(photo);
        star.setBasicInfo(basicInfo);
        return star;
    }

}
